# This Python file uses the following encoding: utf-8
from classifier import *
from data_to_feature import *
from feature_extract import *
from Plots import *
from visualizer import *
from forming_xy import *

X_features = [
    'seq_ad',
    'seq_ns',
    'seq_awd',
    'seq_gd',
    'seq_aspl',
    'seq_cc',
    'seq_lq',
    'seq_lscc',
    'seq_diameter',
    'seq_triangles',
    'seq_ne',
    'seq_nn',
    'cooc_ad',
    'cooc_awd',
    'cooc_gd',
    'cooc_aspl',
    'cooc_cc',
    'cooc_lq',
    'cooc_diameter',
    'cooc_nn',
    'cooc_ne',
    'cooc_ns']

classifiers = [
    KNeighborsClassifier(5),
    SVC(kernel="linear", C=0.025),
    GaussianProcessClassifier(1.0 * RBF(1.0)),
    DecisionTreeClassifier(max_depth=8),
    RandomForestClassifier(max_depth=5, n_estimators=10, max_features=1),
    MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(128,)),
    MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(64,)),
    MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(256,)),
    MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(32,64)),
    LogisticRegression(solver='newton-cg', random_state=0),
    LogisticRegression(penalty='l1', solver='liblinear', random_state=0, max_iter = 200),
    LogisticRegression(random_state=0),
    LogisticRegression(penalty='l2', random_state=0)
]

speech_pts = 'speech-pts.xlsx'
Speech_controls = 'Speech-controls.xlsx'
patients_info = 'patients_info.xlsx'
dir = 'features_mw.csv'

'''
# visualize
test_string = "You should be careful with words which second form is the same as other verb's infinitive. My last unlucky example is fell. WordNetLemmatizer does not convert it into 'fall' because there is actually a verb 'to fell'. Another example is 'felt'."
visualizer(test_string, language = 'english')
'''


# our data
seq_df = our_data_to_feature(speech_pts,Speech_controls,patients_info)
X, Y, features_df = forming_xy(seq_df,X_features)
classifier_full(X, Y, classifiers)


'''
# our data, with new predict
seq_df = our_data_to_feature(speech_pts,Speech_controls,patients_info)
X, Y, features_df = forming_xy(seq_df,X_features)
clf = MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(128,))
best_clf, result_max, result_mean, best_sc = classifier_one(X, Y, clf)
patient = 0  # patient code 
test_string = ' شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم عاشقانه ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم بلند انگلیسی  ا بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا ی شما بهترین متن عاشقانه بلند، متن بلند عاشقانه برای همسر، متن فوق العاده عاشقانه و تاثیرگذار، ناب ترین جملات احساسی بلند،متن عاشقانه بلند غمگین، متن عاشقانه بلند سالگرد ازدواج، متن عاشقانه بلند برای مخاطب خاص، متن عاشقانه بلند برای تولد عشقم، متن عاشقانه بلند انگلیسی و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم و دلنوشته های عاشقانه طولانی را گرد آوری کرده ایم، تا از آنها استفاده کنیداز آنها استفاده کنید'
features_new = for_new_data(test_string, patient, language = 'farsi')
x_new = forming_x(features_new, X_features)
print(classifier_new_data(best_clf, x_new, best_sc))
'''

'''
# other data         Input is one csv files on has 'Text', 'Diagnosis', and 'Subject Code'
list_patient = 'direction'
seq_df = for_new_dataset( list_patient, language = 'farsi')
X, Y, features_df = forming_xy(seq_df,X_features)
clf = MLPClassifier(alpha=0.2, max_iter=1000, hidden_layer_sizes=(128,))
best_clf, result = classifier_one(X, Y, clf)
patient = 0  # patient code
test_string = 'a'  # the text
x_new = for_new_data(test_string, patient, language = 'farsi')
classifier_new_data(best_clf, x_new)
'''